/**************************************** 


테스트 문을 보면
코드 설명과 입출력의 예가 있음

그리고 기본값으로


function solution(num1, num2) {
    
    var answer = -1;
    return answer;
}

이런 식으로 문제에 대한 soulution 함수가
셋팅되어있음.

여기서 함수가 어떻게 작동하느냐?


예시)
num1  = [2,100];
num2 = [3, 2];

solution 함수 1turn:
num1 = 1, num2 = 3

solution 함수 2turn:
num1 = 100, num2 = 2

이런식으로 solution 함수가 여러바퀴 돌면서
값이 정답인지 체크하는 구조 


헐..................................................
이렇게 예상값을 정해준 경우는 
이미 배열 셋팅이 되어있음!!!!!!!!
너무 복잡하게 안가도 됨!

****************************************/

